// --------------------------------------------------------------------------------------------------------------------
// <copyright file="MessageType.cs" company="Rubius">
//   All rights reserved. 2008-2012
// </copyright>
// <summary>
//   Типы сообщений пересылаемых между сервером и клиентом
// </summary>
// --------------------------------------------------------------------------------------------------------------------

namespace UdpChat.Common.Messages
{
    /// <summary>
    /// Типы сообщений пересылаемых между сервером и клиентом
    /// </summary>
    public enum MessageType
    {
        /// <summary>
        /// Сообщение о входе пользователя
        /// </summary>
        Login,

        /// <summary>
        /// Сообщение о выходе пользователя
        /// </summary>
        Logout,

        /// <summary>
        /// Сообщение о записи в чате
        /// </summary>
        ChatMessage,

        /// <summary>
        /// Сообщение со списком контактов
        /// </summary>
        Contacts,       
    }
}